In [10]:
import numpy as np
import pandas as pd

In [11]:
dict1 = {
    "name" : ['himsnshu', 'rahul', 'arun','puran' ], 
    "marks": [92, 34, 24, 17],
    "city" : ['bhubanewar' , 'kolkata' , 'ranpur' , 'NYC']
}

In [12]:
df = pd.DataFrame(dict1)

In [13]:
df

       name  marks        city
0  himsnshu     92  bhubanewar
1     rahul     34     kolkata
2      arun     24      ranpur
3     puran     17         NYC

In [14]:
df.to_csv('friends.csv')

In [15]:
df.to_csv('friends_index_False.csv' , index = False)

In [16]:
df.head(2)

       name  marks        city
0  himsnshu     92  bhubanewar
1     rahul     34     kolkata

In [17]:
df.tail(2)

    name  marks    city
2   arun     24  ranpur
3  puran     17     NYC

In [18]:
df.describe()

          marks
count   4.00000
mean   41.75000
std    34.21866
min    17.00000
25%    22.25000
50%    29.00000
75%    48.50000
max    92.00000

In [19]:
himanshu = pd.read_csv('him.csv')

In [20]:
himanshu

   Unnamed: 0  train nos  speed       citys
0           0         11     50  bhubanewar
1           1         22     34     kolkata
2           2         33     24      ranpur
3           3         44     17         NYC

In [21]:
himanshu['speed']

0    50
1    34
2    24
3    17
Name: speed, dtype: int64

In [22]:
himanshu['speed'][0]

50

In [23]:
himanshu['speed'][0] = 50

C:\Users\KIIT\AppData\Local\Temp\ipykernel_15088\1528690687.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  himanshu['speed'][0] = 50

In [24]:
himanshu

   Unnamed: 0  train nos  speed       citys
0           0         11     50  bhubanewar
1           1         22     34     kolkata
2           2         33     24      ranpur
3           3         44     17         NYC

In [25]:
himanshu.to_csv('him.csv')

In [26]:
himanshu.index = ['first' , 'second', 'third', 'fourth']

In [27]:
himanshu

        Unnamed: 0  train nos  speed       citys
first            0         11     50  bhubanewar
second           1         22     34     kolkata
third            2         33     24      ranpur
fourth           3         44     17         NYC

In [28]:
ser = pd.Series(np.random.rand(34))

In [29]:
ser

0     0.078088
1     0.277203
2     0.715632
3     0.226599
4     0.514616
5     0.720457
6     0.505761
7     0.314746
8     0.372425
9     0.613476
10    0.563231
11    0.100477
12    0.758843
13    0.353916
14    0.147476
15    0.287816
16    0.700562
17    0.768570
18    0.673728
19    0.149779
20    0.240595
21    0.332288
22    0.422615
23    0.532209
24    0.568775
25    0.839588
26    0.875130
27    0.834853
28    0.055944
29    0.708883
30    0.356865
31    0.700698
32    0.549224
33    0.392240
dtype: float64

In [30]:
type(ser)

pandas.core.series.Series

In [31]:
newdf = pd.DataFrame(np.random.rand(334,5) , index = np.arange(334))

In [32]:
newdf.head()

          0         1         2         3         4
0  0.399330  0.530190  0.415161  0.355437  0.336897
1  0.614746  0.277741  0.557056  0.220443  0.150632
2  0.872059  0.298933  0.892599  0.724993  0.207453
3  0.238483  0.201489  0.686212  0.312877  0.245327
4  0.149549  0.275494  0.388653  0.814681  0.987332

In [33]:
newdf

            0         1         2         3         4
0    0.399330  0.530190  0.415161  0.355437  0.336897
1    0.614746  0.277741  0.557056  0.220443  0.150632
2    0.872059  0.298933  0.892599  0.724993  0.207453
3    0.238483  0.201489  0.686212  0.312877  0.245327
4    0.149549  0.275494  0.388653  0.814681  0.987332
..        ...       ...       ...       ...       ...
329  0.554164  0.824629  0.697231  0.944241  0.835009
330  0.620602  0.744703  0.800851  0.383246  0.464304
331  0.677560  0.435991  0.211080  0.685917  0.862708
332  0.796490  0.838713  0.994873  0.261806  0.190942
333  0.969654  0.693023  0.861819  0.181524  0.854689

[334 rows x 5 columns]

In [34]:
type(newdf)

pandas.core.frame.DataFrame

In [35]:
newdf.describe()

                0           1           2           3           4
count  334.000000  334.000000  334.000000  334.000000  334.000000
mean     0.507425    0.480541    0.514012    0.505386    0.530296
std      0.288562    0.283749    0.275408    0.293477    0.284660
min      0.002720    0.000578    0.007296    0.002711    0.000553
25%      0.282386    0.242065    0.294113    0.251181    0.296923
50%      0.503411    0.476057    0.502792    0.547793    0.521168
75%      0.752000    0.732570    0.758429    0.755570    0.767915
max      0.998565    0.999222    0.996294    0.993685    0.999603

In [36]:
newdf.dtypes

0    float64
1    float64
2    float64
3    float64
4    float64
dtype: object

In [37]:
newdf[0][0] = "himanshu"

In [38]:
newdf.dtypes

0     object
1    float64
2    float64
3    float64
4    float64
dtype: object

In [39]:
newdf

            0         1         2         3         4
0    himanshu  0.530190  0.415161  0.355437  0.336897
1    0.614746  0.277741  0.557056  0.220443  0.150632
2    0.872059  0.298933  0.892599  0.724993  0.207453
3    0.238483  0.201489  0.686212  0.312877  0.245327
4    0.149549  0.275494  0.388653  0.814681  0.987332
..        ...       ...       ...       ...       ...
329  0.554164  0.824629  0.697231  0.944241  0.835009
330  0.620602  0.744703  0.800851  0.383246  0.464304
331   0.67756  0.435991  0.211080  0.685917  0.862708
332   0.79649  0.838713  0.994873  0.261806  0.190942
333  0.969654  0.693023  0.861819  0.181524  0.854689

[334 rows x 5 columns]

In [40]:
newdf.index

Index([  0,   1,   2,   3,   4,   5,   6,   7,   8,   9,
       ...
       324, 325, 326, 327, 328, 329, 330, 331, 332, 333],
      dtype='int32', length=334)

In [41]:
newdf.columns

RangeIndex(start=0, stop=5, step=1)

In [42]:
newdf.to_numpy()

array([['himanshu', 0.5301896212999144, 0.41516140584674754,
        0.3554373219512099, 0.3368970600696516],
       [0.6147455085425787, 0.27774143475078594, 0.5570556348359216,
        0.2204430753495542, 0.15063215236881944],
       [0.8720591776327331, 0.29893262402303045, 0.8925991931635713,
        0.7249928391679704, 0.20745349652849832],
       ...,
       [0.6775601574118308, 0.43599113253536514, 0.2110801596800197,
        0.685916724360199, 0.8627079866921004],
       [0.7964899652948944, 0.8387129476347371, 0.9948733947956103,
        0.26180604465054425, 0.1909419434712296],
       [0.9696543024326063, 0.6930226281816589, 0.8618187376438664,
        0.18152375301160228, 0.8546893945925471]], dtype=object)

In [43]:
newdf[0][0] = 34

In [44]:
newdf.head()

          0         1         2         3         4
0        34  0.530190  0.415161  0.355437  0.336897
1  0.614746  0.277741  0.557056  0.220443  0.150632
2  0.872059  0.298933  0.892599  0.724993  0.207453
3  0.238483  0.201489  0.686212  0.312877  0.245327
4  0.149549  0.275494  0.388653  0.814681  0.987332

In [45]:
newdf.T

,0,1,2,3,4,5,6,7,8,9,...,324,325,326,327,328,329,330,331,332,333
0,34,0.614746,0.872059,0.238483,0.149549,0.046057,0.031796,0.729529,0.00272,0.280505,...,0.197103,0.889579,0.023495,0.633059,0.444764,0.554164,0.620602,0.67756,0.79649,0.969654
1,0.53019,0.277741,0.298933,0.201489,0.275494,0.55716,0.119135,0.012989,0.637304,0.460191,...,0.187891,0.937114,0.543134,0.828937,0.100521,0.824629,0.744703,0.435991,0.838713,0.693023
2,0.415161,0.557056,0.892599,0.686212,0.388653,0.640706,0.553879,0.623074,0.321242,0.417796,...,0.516783,0.051339,0.826099,0.720126,0.811212,0.697231,0.800851,0.21108,0.994873,0.861819
3,0.355437,0.220443,0.724993,0.312877,0.814681,0.873547,0.697248,0.579315,0.277554,0.552453,...,0.68088,0.746111,0.170373,0.508342,0.364219,0.944241,0.383246,0.685917,0.261806,0.181524
4,0.336897,0.150632,0.207453,0.245327,0.987332,0.569186,0.305594,0.401513,0.48931,0.920659,...,0.714222,0.467153,0.079318,0.307276,0.396446,0.835009,0.464304,0.862708,0.190942,0.854689

In [46]:
newdf.T.T

            0         1         2         3         4
0          34   0.53019  0.415161  0.355437  0.336897
1    0.614746  0.277741  0.557056  0.220443  0.150632
2    0.872059  0.298933  0.892599  0.724993  0.207453
3    0.238483  0.201489  0.686212  0.312877  0.245327
4    0.149549  0.275494  0.388653  0.814681  0.987332
..        ...       ...       ...       ...       ...
329  0.554164  0.824629  0.697231  0.944241  0.835009
330  0.620602  0.744703  0.800851  0.383246  0.464304
331   0.67756  0.435991   0.21108  0.685917  0.862708
332   0.79649  0.838713  0.994873  0.261806  0.190942
333  0.969654  0.693023  0.861819  0.181524  0.854689

[334 rows x 5 columns]

In [47]:
newdf.sort_index(axis = 0 , ascending = False)

            0         1         2         3         4
333  0.969654  0.693023  0.861819  0.181524  0.854689
332   0.79649  0.838713  0.994873  0.261806  0.190942
331   0.67756  0.435991  0.211080  0.685917  0.862708
330  0.620602  0.744703  0.800851  0.383246  0.464304
329  0.554164  0.824629  0.697231  0.944241  0.835009
..        ...       ...       ...       ...       ...
4    0.149549  0.275494  0.388653  0.814681  0.987332
3    0.238483  0.201489  0.686212  0.312877  0.245327
2    0.872059  0.298933  0.892599  0.724993  0.207453
1    0.614746  0.277741  0.557056  0.220443  0.150632
0          34  0.530190  0.415161  0.355437  0.336897

[334 rows x 5 columns]

In [48]:
newdf.sort_index(axis = 1 , ascending = False)

            4         3         2         1         0
0    0.336897  0.355437  0.415161  0.530190        34
1    0.150632  0.220443  0.557056  0.277741  0.614746
2    0.207453  0.724993  0.892599  0.298933  0.872059
3    0.245327  0.312877  0.686212  0.201489  0.238483
4    0.987332  0.814681  0.388653  0.275494  0.149549
..        ...       ...       ...       ...       ...
329  0.835009  0.944241  0.697231  0.824629  0.554164
330  0.464304  0.383246  0.800851  0.744703  0.620602
331  0.862708  0.685917  0.211080  0.435991   0.67756
332  0.190942  0.261806  0.994873  0.838713   0.79649
333  0.854689  0.181524  0.861819  0.693023  0.969654

[334 rows x 5 columns]

In [49]:
type(newdf[0])

pandas.core.series.Series

In [50]:
newdf2 = newdf

In [51]:
newdf2[0][0] = 9783

In [52]:
newdf

            0         1         2         3         4
0        9783  0.530190  0.415161  0.355437  0.336897
1    0.614746  0.277741  0.557056  0.220443  0.150632
2    0.872059  0.298933  0.892599  0.724993  0.207453
3    0.238483  0.201489  0.686212  0.312877  0.245327
4    0.149549  0.275494  0.388653  0.814681  0.987332
..        ...       ...       ...       ...       ...
329  0.554164  0.824629  0.697231  0.944241  0.835009
330  0.620602  0.744703  0.800851  0.383246  0.464304
331   0.67756  0.435991  0.211080  0.685917  0.862708
332   0.79649  0.838713  0.994873  0.261806  0.190942
333  0.969654  0.693023  0.861819  0.181524  0.854689

[334 rows x 5 columns]

In [53]:
newdf2 = newdf.copy()

In [54]:
newdf2[0][0] = 97835

C:\Users\KIIT\AppData\Local\Temp\ipykernel_15088\3150214023.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  newdf2[0][0] = 97835

In [55]:
newdf

            0         1         2         3         4
0        9783  0.530190  0.415161  0.355437  0.336897
1    0.614746  0.277741  0.557056  0.220443  0.150632
2    0.872059  0.298933  0.892599  0.724993  0.207453
3    0.238483  0.201489  0.686212  0.312877  0.245327
4    0.149549  0.275494  0.388653  0.814681  0.987332
..        ...       ...       ...       ...       ...
329  0.554164  0.824629  0.697231  0.944241  0.835009
330  0.620602  0.744703  0.800851  0.383246  0.464304
331   0.67756  0.435991  0.211080  0.685917  0.862708
332   0.79649  0.838713  0.994873  0.261806  0.190942
333  0.969654  0.693023  0.861819  0.181524  0.854689

[334 rows x 5 columns]

In [56]:
newdf.loc[0,0] = 654

In [57]:
newdf.head(2)

          0         1         2         3         4
0       654  0.530190  0.415161  0.355437  0.336897
1  0.614746  0.277741  0.557056  0.220443  0.150632

In [58]:
newdf.columns = list("ABCDE")

In [59]:
newdf.head(2)

          A         B         C         D         E
0       654  0.530190  0.415161  0.355437  0.336897
1  0.614746  0.277741  0.557056  0.220443  0.150632

In [60]:
newdf.loc[0,'A'] = 654

In [61]:
newdf.head(2)

          A         B         C         D         E
0       654  0.530190  0.415161  0.355437  0.336897
1  0.614746  0.277741  0.557056  0.220443  0.150632

In [62]:
newdf.loc[0,0] = 6549

In [63]:
newdf.head(2)

          A         B         C         D         E       0
0       654  0.530190  0.415161  0.355437  0.336897  6549.0
1  0.614746  0.277741  0.557056  0.220443  0.150632     NaN

In [64]:
newdf =newdf.drop(0, axis = 1)

In [65]:
newdf.head()

          A         B         C         D         E
0       654  0.530190  0.415161  0.355437  0.336897
1  0.614746  0.277741  0.557056  0.220443  0.150632
2  0.872059  0.298933  0.892599  0.724993  0.207453
3  0.238483  0.201489  0.686212  0.312877  0.245327
4  0.149549  0.275494  0.388653  0.814681  0.987332

In [66]:
newdf.loc[[1,2] , ['C', 'D']]

          C         D
1  0.557056  0.220443
2  0.892599  0.724993

In [67]:
newdf.head()

          A         B         C         D         E
0       654  0.530190  0.415161  0.355437  0.336897
1  0.614746  0.277741  0.557056  0.220443  0.150632
2  0.872059  0.298933  0.892599  0.724993  0.207453
3  0.238483  0.201489  0.686212  0.312877  0.245327
4  0.149549  0.275494  0.388653  0.814681  0.987332

In [68]:
newdf.loc[:, ['C', 'D']]

            C         D
0    0.415161  0.355437
1    0.557056  0.220443
2    0.892599  0.724993
3    0.686212  0.312877
4    0.388653  0.814681
..        ...       ...
329  0.697231  0.944241
330  0.800851  0.383246
331  0.211080  0.685917
332  0.994873  0.261806
333  0.861819  0.181524

[334 rows x 2 columns]

In [69]:
newdf.loc[[1,2] , :]

          A         B         C         D         E
1  0.614746  0.277741  0.557056  0.220443  0.150632
2  0.872059  0.298933  0.892599  0.724993  0.207453

In [70]:
newdf.loc[(newdf['A']<0.3)]

            A         B         C         D         E
3    0.238483  0.201489  0.686212  0.312877  0.245327
4    0.149549  0.275494  0.388653  0.814681  0.987332
5    0.046057  0.557160  0.640706  0.873547  0.569186
6    0.031796  0.119135  0.553879  0.697248  0.305594
8     0.00272  0.637304  0.321242  0.277554  0.489310
..        ...       ...       ...       ...       ...
318  0.043408  0.273519  0.136732  0.347232  0.724679
321   0.26312  0.584691  0.902517  0.700771  0.935752
323  0.133083  0.579389  0.544224  0.925594  0.615568
324  0.197103  0.187891  0.516783  0.680880  0.714222
326  0.023495  0.543134  0.826099  0.170373  0.079318

[89 rows x 5 columns]

In [71]:
newdf.loc[(newdf['A']<0.3) & (newdf['A']>0.1)]

            A         B         C         D         E
3    0.238483  0.201489  0.686212  0.312877  0.245327
4    0.149549  0.275494  0.388653  0.814681  0.987332
9    0.280505  0.460191  0.417796  0.552453  0.920659
10   0.142833  0.593504  0.766230  0.706863  0.883723
13   0.169891  0.542641  0.781590  0.533185  0.813709
24   0.207815  0.238531  0.918627  0.584105  0.573619
27   0.214542  0.551219  0.662216  0.576458  0.734851
32   0.282059  0.518271  0.383801  0.492091  0.449426
39   0.107605  0.418420  0.467472  0.689659  0.436939
46   0.252026  0.481797  0.522913  0.234828  0.644791
51   0.185466  0.731830  0.230810  0.779327  0.660717
53   0.247984  0.053720  0.414551  0.916024  0.358090
58   0.170194  0.488119  0.363959  0.034036  0.965782
72   0.184133  0.023573  0.784556  0.622196  0.998247
77   0.198997  0.314413  0.561538  0.735252  0.983809
86   0.245374  0.094753  0.324814  0.888176  0.212566
90   0.262594  0.873649  0.544540  0.352712  0.414185
98    0.11874  0.867431  0.095169  0.879722  0.635230
127  0.125412  0.427572  0.324613  0.748053  0.295847
128  0.211188  0.863538  0.701334  0.791613  0.967183
131   0.14485  0.765136  0.427632  0.622922  0.840967
135    0.1799  0.056338  0.814962  0.033876  0.777347
145  0.153201  0.590723  0.387125  0.830493  0.524015
147  0.122167  0.782593  0.410988  0.916282  0.737441
151  0.214918  0.159732  0.398594  0.472688  0.264772
156  0.112414  0.502780  0.757168  0.278191  0.507436
157  0.202064  0.902946  0.694116  0.126336  0.218876
158  0.135924  0.955042  0.332162  0.186028  0.239715
169  0.194217  0.396410  0.940920  0.546939  0.032481
172    0.1898  0.719503  0.329912  0.884497  0.164208
179  0.186514  0.379685  0.241260  0.367220  0.807937
186  0.295422  0.700132  0.418890  0.224029  0.932703
193  0.114975  0.991420  0.742428  0.631476  0.937090
197  0.121169  0.697905  0.197198  0.044808  0.922034
199  0.167319  0.791075  0.788170  0.130628  0.741572
227  0.184676  0.484746  0.184717  0.954379  0.983648
230  0.266117  0.373189  0.881526  0.806157  0.483546
231  0.183475  0.999222  0.621961  0.956699  0.104628
234  0.283367  0.915094  0.787162  0.228147  0.361824
236  0.117207  0.434146  0.108619  0.349779  0.665158
242  0.145623  0.690231  0.578125  0.772499  0.906115
249  0.285167  0.628033  0.024579  0.457050  0.595566
251  0.166542  0.016719  0.143219  0.895632  0.925280
257  0.117792  0.922071  0.262693  0.910340  0.351406
281  0.296408  0.771282  0.076070  0.798757  0.411612
284  0.190515  0.127488  0.115250  0.019774  0.883421
299  0.173219  0.732817  0.615586  0.560042  0.989287
304  0.287009  0.365839  0.346140  0.666305  0.979938
307   0.11831  0.142132  0.458656  0.195025  0.094030
321   0.26312  0.584691  0.902517  0.700771  0.935752
323  0.133083  0.579389  0.544224  0.925594  0.615568
324  0.197103  0.187891  0.516783  0.680880  0.714222

In [72]:
newdf.head(2)

          A         B         C         D         E
0       654  0.530190  0.415161  0.355437  0.336897
1  0.614746  0.277741  0.557056  0.220443  0.150632

In [73]:
newdf.iloc[0,4]

0.3368970600696516

In [74]:
newdf.iloc[[0,1], [1,2]]

          B         C
0  0.530190  0.415161
1  0.277741  0.557056

In [75]:
newdf.head(3)

          A         B         C         D         E
0       654  0.530190  0.415161  0.355437  0.336897
1  0.614746  0.277741  0.557056  0.220443  0.150632
2  0.872059  0.298933  0.892599  0.724993  0.207453

In [76]:
newdf.drop([0])

            A         B         C         D         E
1    0.614746  0.277741  0.557056  0.220443  0.150632
2    0.872059  0.298933  0.892599  0.724993  0.207453
3    0.238483  0.201489  0.686212  0.312877  0.245327
4    0.149549  0.275494  0.388653  0.814681  0.987332
5    0.046057  0.557160  0.640706  0.873547  0.569186
..        ...       ...       ...       ...       ...
329  0.554164  0.824629  0.697231  0.944241  0.835009
330  0.620602  0.744703  0.800851  0.383246  0.464304
331   0.67756  0.435991  0.211080  0.685917  0.862708
332   0.79649  0.838713  0.994873  0.261806  0.190942
333  0.969654  0.693023  0.861819  0.181524  0.854689

[333 rows x 5 columns]

In [77]:
newdf.drop(['A'], axis =1)

            B         C         D         E
0    0.530190  0.415161  0.355437  0.336897
1    0.277741  0.557056  0.220443  0.150632
2    0.298933  0.892599  0.724993  0.207453
3    0.201489  0.686212  0.312877  0.245327
4    0.275494  0.388653  0.814681  0.987332
..        ...       ...       ...       ...
329  0.824629  0.697231  0.944241  0.835009
330  0.744703  0.800851  0.383246  0.464304
331  0.435991  0.211080  0.685917  0.862708
332  0.838713  0.994873  0.261806  0.190942
333  0.693023  0.861819  0.181524  0.854689

[334 rows x 4 columns]

In [78]:
newdf.drop(['A','D'], axis =1)

            B         C         E
0    0.530190  0.415161  0.336897
1    0.277741  0.557056  0.150632
2    0.298933  0.892599  0.207453
3    0.201489  0.686212  0.245327
4    0.275494  0.388653  0.987332
..        ...       ...       ...
329  0.824629  0.697231  0.835009
330  0.744703  0.800851  0.464304
331  0.435991  0.211080  0.862708
332  0.838713  0.994873  0.190942
333  0.693023  0.861819  0.854689

[334 rows x 3 columns]

In [79]:
newdf.drop(['A','D'], axis =1, inplace=True)

In [80]:
newdf

            B         C         E
0    0.530190  0.415161  0.336897
1    0.277741  0.557056  0.150632
2    0.298933  0.892599  0.207453
3    0.201489  0.686212  0.245327
4    0.275494  0.388653  0.987332
..        ...       ...       ...
329  0.824629  0.697231  0.835009
330  0.744703  0.800851  0.464304
331  0.435991  0.211080  0.862708
332  0.838713  0.994873  0.190942
333  0.693023  0.861819  0.854689

[334 rows x 3 columns]

In [81]:
newdf.drop([1,5], axis =0, inplace=True)

In [82]:
newdf.head()

          B         C         E
0  0.530190  0.415161  0.336897
2  0.298933  0.892599  0.207453
3  0.201489  0.686212  0.245327
4  0.275494  0.388653  0.987332
6  0.119135  0.553879  0.305594

In [83]:
newdf.reset_index()

     index         B         C         E
0        0  0.530190  0.415161  0.336897
1        2  0.298933  0.892599  0.207453
2        3  0.201489  0.686212  0.245327
3        4  0.275494  0.388653  0.987332
4        6  0.119135  0.553879  0.305594
..     ...       ...       ...       ...
327    329  0.824629  0.697231  0.835009
328    330  0.744703  0.800851  0.464304
329    331  0.435991  0.211080  0.862708
330    332  0.838713  0.994873  0.190942
331    333  0.693023  0.861819  0.854689

[332 rows x 4 columns]

In [84]:
newdf.reset_index(drop=True, inplace=True)

In [85]:
newdf

            B         C         E
0    0.530190  0.415161  0.336897
1    0.298933  0.892599  0.207453
2    0.201489  0.686212  0.245327
3    0.275494  0.388653  0.987332
4    0.119135  0.553879  0.305594
..        ...       ...       ...
327  0.824629  0.697231  0.835009
328  0.744703  0.800851  0.464304
329  0.435991  0.211080  0.862708
330  0.838713  0.994873  0.190942
331  0.693023  0.861819  0.854689

[332 rows x 3 columns]

In [86]:
newdf.head(3)

          B         C         E
0  0.530190  0.415161  0.336897
1  0.298933  0.892599  0.207453
2  0.201489  0.686212  0.245327

In [87]:
newdf['B'].isnull()

0      False
1      False
2      False
3      False
4      False
       ...
327    False
328    False
329    False
330    False
331    False
Name: B, Length: 332, dtype: bool

In [88]:
newdf['B'] = None

In [89]:
newdf

        B         C         E
0    None  0.415161  0.336897
1    None  0.892599  0.207453
2    None  0.686212  0.245327
3    None  0.388653  0.987332
4    None  0.553879  0.305594
..    ...       ...       ...
327  None  0.697231  0.835009
328  None  0.800851  0.464304
329  None  0.211080  0.862708
330  None  0.994873  0.190942
331  None  0.861819  0.854689

[332 rows x 3 columns]

In [90]:
newdf.loc[:, ['B']] = 56

In [91]:
newdf.head()

    B         C         E
0  56  0.415161  0.336897
1  56  0.892599  0.207453
2  56  0.686212  0.245327
3  56  0.388653  0.987332
4  56  0.553879  0.305594

In [92]:
df =  pd.DataFrame({
    "name" : ['Alfred', 'Batman', 'Catwomen' ], 
    "toy": [np.nan, 'Batmobile','Bullwhip'],
    "born" : [pd.NaT,pd.Timestamp("1940-04-25"),pd.NaT]
})

In [93]:
df.head()

       name        toy       born
0    Alfred        NaN        NaT
1    Batman  Batmobile 1940-04-25
2  Catwomen   Bullwhip        NaT

In [94]:
df.dropna()

     name        toy       born
1  Batman  Batmobile 1940-04-25

In [95]:
df.dropna(how='all' , axis =1)

       name        toy       born
0    Alfred        NaN        NaT
1    Batman  Batmobile 1940-04-25
2  Catwomen   Bullwhip        NaT

In [96]:
df.drop_duplicates()

       name        toy       born
0    Alfred        NaN        NaT
1    Batman  Batmobile 1940-04-25
2  Catwomen   Bullwhip        NaT

In [97]:
df.drop_duplicates(subset=['name'],keep='last')

       name        toy       born
0    Alfred        NaN        NaT
1    Batman  Batmobile 1940-04-25
2  Catwomen   Bullwhip        NaT

In [98]:
df.drop_duplicates(subset=['name'],keep=False)

       name        toy       born
0    Alfred        NaN        NaT
1    Batman  Batmobile 1940-04-25
2  Catwomen   Bullwhip        NaT

In [99]:
df.shape

(3, 3)

In [100]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   name    3 non-null      object
 1   toy     2 non-null      object
 2   born    1 non-null      datetime64[ns]
dtypes: datetime64[ns](1), object(2)
memory usage: 204.0+ bytes

In [101]:
df['name'].value_counts(dropna =False)

name
Alfred      1
Batman      1
Catwomen    1
Name: count, dtype: int64

In [102]:
df['toy'].value_counts(dropna =False)

toy
NaN          1
Batmobile    1
Bullwhip     1
Name: count, dtype: int64

In [103]:
df.notnull()

   name    toy   born
0  True  False  False
1  True   True   True
2  True   True  False

In [104]:
df.isnull()

    name    toy   born
0  False   True   True
1  False  False  False
2  False  False   True

In [105]:
# create  a dataframe which contains only integer with 3 rows and 3 columns
#run the following dataframe method on them:

# df.describe()
# df.mean()
# df.corr()
# df.count()
# df.max()
# df.min()
# df.median()
# df.std()

In [106]:
import pandas as pd
import numpy as np


intdf = pd.DataFrame(np.random.randint(100, size = (3,2)))

print(intdf)
print(intdf.describe())
print(intdf.mean())
print(intdf.corr())
print(intdf.count())
print(intdf.max())
print(intdf.min())
print(intdf.median())
print(intdf.std())

    0   1
0  34  85
1  31  43
2  77  45
               0          1
count   3.000000   3.000000
mean   47.333333  57.666667
std    25.735838  23.692474
min    31.000000  43.000000
25%    32.500000  44.000000
50%    34.000000  45.000000
75%    55.500000  65.000000
max    77.000000  85.000000
0    47.333333
1    57.666667
dtype: float64
          0         1
0  1.000000 -0.410554
1 -0.410554  1.000000
0    3
1    3
dtype: int64
0    77
1    85
dtype: int32
0    31
1    43
dtype: int32
0    34.0
1    45.0
dtype: float64
0    25.735838
1    23.692474
dtype: float64

In [107]:
marks= {
    "name":['sita', 'gita'],
    "marks":[83, 93],
    "city":["delhi", "hyderabad"]
}
df=pd.DataFrame(marks)
df

df.describe()
print(intdf.mean())
print(intdf.corr())
print(intdf.count())
print(intdf.max())
print(intdf.min())
print(intdf.median())
print(intdf.std())

0    47.333333
1    57.666667
dtype: float64
          0         1
0  1.000000 -0.410554
1 -0.410554  1.000000
0    3
1    3
dtype: int64
0    77
1    85
dtype: int32
0    31
1    43
dtype: int32
0    34.0
1    45.0
dtype: float64
0    25.735838
1    23.692474
dtype: float64

In [108]:
data = pd.read_excel('data.xlsx')